Revit 2027 API
RouteAnalysisSettings.GetIgnoredCategoryIds Method
 Returns ElementIds for Category elements which are ignored (not taken into account) route calculation. To enable ignoring of these categories, EnableIgnoredCategoryIds must be set to true. If an ignored category has sub-categories, then the sub-categories will be ignored as well.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetIgnoredCategoryIds()
Public Function GetIgnoredCategoryIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetIgnoredCategoryIds()
member GetIgnoredCategoryIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The ids of Categories which are ignored by route calculation. By default, the set contains the Doors Category.
See Also
Reference
RouteAnalysisSettings Class
Autodesk.Revit.DB.Analysis Namespace